ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l211x_l112x/UC11_UART_1.0.xml
    <register id="UC61_UART_STAT" width="32" offset="0x1108" description="UART Status Register">
        <bitfield id="BUSY" description="UART Busy
			This bit is set as soon as the transmit FIFO/buffer becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The UART is not busy."/>
            <bitenum id="SET" value="0x1" description="The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register."/>
        </bitfield>
    </register>
    <register id="UC61_UART_IBRD" width="32" offset="0x1110" description="UART Integer Baud-Rate Divisor Register">
        <bitfield id="DIVINT" description="Integer Baud-Rate Divisor" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC61_UART_FBRD" width="32" offset="0x1114" description="UART Fractional Baud-Rate Divisor Register">
        <bitfield id="DIVFRAC" description="Fractional Baud-Rate Divisor" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC61_UART_TXDATA" width="32" offset="0x1120" description="UART Transmit Data Register">
        <bitfield id="DATA" description="Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC61_UART_RXDATA" width="32" offset="0x1124" description="UART Receive Data Register">
        <bitfield id="DATA" description="Received Data.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FRMERR" description="UART Framing Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the FRMERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No framing error has occurred"/>
            <bitenum id="SET" value="0x1" description="The received character does not have a valid stop bit sequence, which is one or two stop bits depending on the UARTLCRH.STP2 setting (a valid stop bit is 1)."/>
        </bitfield>
        <bitfield id="PARERR" description="UART Parity Error   Writing to this bit has no effect. The flag is cleared by writing 1 to the PARERR bit in the UART EVENT ICLR register." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No parity error has occurred"/>
            <bitenum id="SET" value="0x1" description="The parity of the received data character does not match the parity defined by bits 2 and 7 of the UARTLCRH register."/>
        </bitfield>
        <bitfield id="BRKERR" description="UART Break Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the BRKERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No break condition has occurred"/>
            <bitenum id="SET" value="0x1" description="A break condition has been detected, indicating that the receive data input was held low for longer than a full-word transmission time (defined as start, data, parity, and stop bits)."/>
        </bitfield>
        <bitfield id="NERR" description="Noise Error.
Writing to this bit has no effect. The flag is cleared by writing 1 to the NERR bit in the UART EVENT ICLR register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No noise error occurred"/>
            <bitenum id="SET" value="0x1" description="Noise error occurred during majority voting"/>
        </bitfield>
    </register>

</module>